// *******************************************************************************************************
// # サイト共通スクリプト
//   ・スムーズスクロール
//   ・SVG描画
//   ・フッターのXML読み込み
// *******************************************************************************************************

(function(win, doc) {

	/* スムーズスクロール
	----------------------------------- */
	function setSmoothScroll(elm, position) {
		elm.on('click', function(e) {
			e.preventDefault();
			$.scrollTo(position, 800);
		});
	}
	
	/* SVG描画
	----------------------------------- */
	// パス指定
	var RJLogoPath = 'M13.115,7.017C0.098,7.017,0,17.08,0,19.129c0,1.332,0,15.747,0,15.747h9.534c0,0,0-11.232,0-15.437    c0-3.388,2.455-2.978,3.582-2.978V7.017z M43.608,34.882h9.268V10.234h-9.268V34.882z M43.681,8.214h9.266V0h-9.266V8.214z     M41.911,20.461H41.89c-0.579-7.653-6.948-13.674-14.738-13.674c-8.159,0-14.778,6.627-14.778,14.808    c0,8.178,6.619,14.802,14.778,14.802c2.319,0,4.508-0.523,6.455-1.477v-0.009h8.303V22.44c0.02-0.281,0.022-0.561,0.022-0.846    c0-0.285-0.002-0.565-0.022-0.85V20.461z M27.153,26.821c-2.881,0-5.213-2.34-5.213-5.227c0-2.887,2.331-5.224,5.213-5.224    c2.883,0,5.218,2.337,5.218,5.224C32.371,24.48,30.036,26.821,27.153,26.821z M96.527,6.786c-1.886,0-3.696,0.356-5.353,1.003V0    h-9.193v21.594c0,8.178,6.384,14.802,14.545,14.802c8.169,0,14.78-6.624,14.78-14.802C111.307,13.413,104.695,6.786,96.527,6.786z     M96.527,26.821c-2.884,0-5.217-2.34-5.217-5.227c0-2.887,2.332-5.224,5.217-5.224c2.882,0,5.218,2.337,5.218,5.224    C101.745,24.48,99.408,26.821,96.527,26.821z M127.133,6.786c-8.164,0-14.78,6.627-14.78,14.808    c0,8.178,6.616,14.802,14.78,14.802c8.163,0,14.777-6.624,14.777-14.802C141.91,13.413,135.296,6.786,127.133,6.786z     M127.133,26.821c-2.879,0-5.218-2.34-5.218-5.227c0-2.887,2.339-5.224,5.218-5.224c2.882,0,5.219,2.337,5.219,5.224    C132.352,24.48,130.015,26.821,127.133,26.821z M67.629,7.222c-10.351,0-13.117,9.238-13.117,12.525c0,2.614,0,15.164,0,15.164    h9.611c0,0,0-12.035,0-14.907c0-2.367,1.868-3.751,3.506-3.751c1.642,0,3.509,1.384,3.509,3.751c0,2.872,0,14.907,0,14.907h9.606    c0,0,0-12.549,0-15.164C80.745,16.46,77.98,7.222,67.629,7.222z M172.352,8.413c0,0,0,14.173,0,15.813    c0,1.645-0.814,2.395-2.386,2.395c-1.573,0-2.17-1.157-2.17-2.461c0-0.887,0-15.746,0-15.746h-10.148c0,0,0,14.859,0,15.746    c0,1.304-0.59,2.461-2.162,2.461c-1.573,0-2.392-0.75-2.392-2.395c0-1.639,0-15.813,0-15.813h-9.631c0,0,0,15.197,0,17.05    c0,1.843,1.775,10.878,11.743,10.878c4.784,0,7.519-2.461,7.519-2.461s2.726,2.461,7.511,2.461c9.977,0,11.75-9.034,11.75-10.878    c0-1.853,0-17.05,0-17.05H172.352z M7.15,41.676h2.118V39.97H7.15V41.676z M47.44,43.546c-4.191,0-3.801,2.989-3.801,2.989h2.166    c0-0.446,0.378-1.713,1.891-1.713c1.502,0,1.647,1.535,1.681,1.962c0.008,0.047,0.017,0.342,0.029,0.776    c-0.703-0.028-3.693-0.115-4.66,0.435c-1.137,0.644-1.706,1.636-1.706,2.561c0,0.928,0.443,2.864,3.393,2.864    c1.631,0,2.577-0.885,3.097-1.674c0.026,0.901,0.047,1.567,0.047,1.567h2.169c0,0-0.108-6.081-0.108-6.368    C51.637,46.661,51.637,43.546,47.44,43.546z M47.143,52.011c-1.852,0-1.984-1.906-1.279-2.647c0.798-0.838,3.46-0.618,3.46-0.618    s0.069,0.671,0.069,0.867C49.394,49.809,48.989,52.011,47.143,52.011z M130.459,43.546c-4.19,0-3.796,2.989-3.796,2.989h2.168    c0-0.446,0.367-1.713,1.88-1.713c1.51,0,1.651,1.535,1.688,1.962c0.002,0.047,0.012,0.342,0.031,0.776    c-0.711-0.028-3.698-0.115-4.668,0.435c-1.135,0.644-1.703,1.636-1.703,2.561c0,0.928,0.442,2.864,3.391,2.864    c1.63,0,2.583-0.885,3.099-1.674c0.024,0.901,0.048,1.567,0.048,1.567h2.165c0,0-0.105-6.081-0.105-6.368    C134.654,46.661,134.654,43.546,130.459,43.546z M130.161,52.011c-1.846,0-1.988-1.906-1.281-2.647    c0.799-0.838,3.461-0.618,3.461-0.618s0.075,0.671,0.075,0.867C132.417,49.809,132.01,52.011,130.161,52.011z M7.15,54.381    c0,0.495-0.735,1.121-1.95,1.121v1.147c0,0,0.469,0.084,1.33,0.084c0.857,0,1.844-0.243,2.238-0.668    c0.389-0.43,0.5-1.165,0.5-1.684V43.948H7.15V54.381z M90.004,44.008c-1.399,0-2.475,1.001-2.982,1.581v-1.193h-2.224v12.603    h2.224v-4.691c0.507,0.566,1.579,1.523,2.982,1.523c1.968,0,3.784-1.455,3.784-4.756C93.788,45.492,91.972,44.008,90.004,44.008z     M89.17,52.225c-1.939,0-2.152-2.384-2.152-2.74c0-0.358-0.022-0.546-0.022-0.546l0.022-0.549c0,0,0.214-2.738,2.152-2.738    c2.005,0,2.427,1.827,2.427,3.288C91.597,50.403,91.174,52.225,89.17,52.225z M173.499,43.948c-1.686,0-2.678,0.884-3.148,1.45    v-1.318h-2.222v9.289h2.222v-5.765c0.095-1.388,0.848-2.134,2.16-2.134c1.574,0,2.047,1.576,2.047,1.954v5.944h2.169v-5.944    C176.728,46.002,175.978,43.948,173.499,43.948z';

	// URLからパスを取得して/で分割
	var pagePath = window.location.pathname.split('/');
	// 配列の後ろから2つ目を取得
	var pageCategory = pagePath[pagePath.length-2];
	
	// トップページのみ
	if (pageCategory == '') {
		var RJLogoTop = Raphael('RJLogoTop', 182, 57);
		var RJLogoTopAttr = {'stroke': 'none', 'fill': '#333', 'title': '株式会社レインボー・ジャパン'};
		RJLogoTop.path(RJLogoPath).attr(RJLogoTopAttr);
	}
	
	// フッターのRJロゴ（全ページ共通）
	var RJLogoFooter = Raphael('RJLogoFooter', 172, 54);
	var RJLogoFooterAttr = {'stroke': 'none', 'fill': '#fff', 'title': '株式会社レインボー・ジャパン'};
	RJLogoFooter.path(RJLogoPath).attr(RJLogoFooterAttr).scale(0.94, 0.94, 0, 0);
	
	// トップページ以外
	if (pageCategory != '') {
		// ヘッダーのRJロゴ
		var RJLogoHeader = Raphael('RJLogoHeader', 128, 40);
		var RJLogoHeaderAttr = {'stroke': 'none', 'fill': '#333', 'title': '株式会社レインボー・ジャパン'};
		RJLogoHeader.path(RJLogoPath).attr(RJLogoHeaderAttr).scale(0.7, 0.7, 0, 0);
	}
	
	// 会社概要のみ
	if (pageCategory == 'company') {
		var RJLogoCompany = Raphael('RJLogoCompany', 175, 55);
		var RJLogoCompanyAttr = {'stroke': 'none', 'fill': '#00418e', 'title': '株式会社レインボー・ジャパン'};
		RJLogoCompany.path(RJLogoPath).attr(RJLogoCompanyAttr).scale(0.96, 0.96, 0, 0);
	}
	
	/* フッターのXML読み込み
	----------------------------------- */
	function xmlLoad(contents, xmlPath) {
		var contentsFooter = $('#' + contents + 'Footer');
		var entryPicSize = 74; // ベースサイズ
		var newsElm = '';
		
		$.ajax({
			type    : 'GET',
			url     : xmlPath,
			dataType: 'xml',
			cache   : false
		})
		.done(function(xml) {
			// 成功
			$(xml).find('list').each(function(i) {
				var $self = $(this);
				var entryPostType     = $self.find('post_type').text();
				var entryTitle        = $self.find('title').text();
				var entryURL          = $self.find('url').text();
				var entryDate         = $self.find('date').text();
				var entryDateTime     = entryDate.replace(/\D/g, '-'); // 数字以外（.）を - に置換
				var entryPicURL       = $self.find('pic_url').text();
				var entryPicFooterURL = $self.find('pic_footer_url').text();
				
				if (entryPostType != 'works') {
					// 制作実績以外のDOM構築
					newsElm +=
					'<article class="news type-' + entryPostType +'">' +
					'<div class="box-txt">' +
					'<h3 class="date-news"><time datetime="' + entryDateTime + '">' + entryDate + '</time></h3>' +
					'<p class="lead-news"><a href="' + entryURL + '">' + entryTitle + '</a></p>' +
					'</div>' +
					'<p class="pic"><img src="' + entryPicURL + '" alt="' + entryTitle + '" /></p>' +
					'</article>';
				} else {
					// 制作実績のDOM構築（フッター用の画像が違うだけ）
					newsElm +=
					'<article class="news type-' + entryPostType +'">' +
					'<div class="box-txt">' +
					'<h3 class="date-news"><time datetime="' + entryDateTime + '">' + entryDate + '</time></h3>' +
					'<p class="lead-news"><a href="' + entryURL + '">' + entryTitle + '</a></p>' +
					'</div>' +
					'<p class="pic"><img src="' + entryPicFooterURL + '" alt="' + entryTitle + '" /></p>' +
					'</article>';
				}
			});
			
			// html出力
			contentsFooter.html(newsElm);
		})
		.fail(function() {
			// 失敗
			contentsFooter.append('<p>リクエストに失敗しています。</p>');
		})
		.always(function() {
			// 完了
		});
	}
	
	/* 実行
	----------------------------------- */
	$(function() {
		setSmoothScroll($('.go-top a'), 0);
		setSmoothScroll($('.js-btn-interview'), $('#interview'));
		xmlLoad('news', '/api_news/');
		xmlLoad('blog', '/api_blog/');
		//xmlLoad('news', '/api_news.xml');
		//xmlLoad('blog', '/api_blog.xml');
	});

})(this, document);
